<template>
  <div class="help">
    <!-- 只支持安卓5.0以上版本 -->
    <h2>常见问答</h2>
    <h3>1、上传的文件保存到哪里去了？</h3>
    <p>
    所有上传的文件都保存在安卓sd卡的mystore目录。应用不会触及其它目录和文件，上传的文件可用其它app打开，比如用其它播放器播放其中音频/视频，用微软word打开.doc文件……
    </p>
    <h3>2、选择图片、音频、视频分类时会显示所有子目录下该类型的文件吗？</h3>
    <p>
    不会显示子目录中的内容，只显示【当前目录】中的文件。
    【当前目录】显示在“文件管理”上面的标题栏，点<i class="material-icons">folder</i>进入子目录，点<i class="material-icons">keyboard_backspace</i>返回上级目录。
    点右上角的<i class="material-icons">create_new_folder</i>在当前目录中新建文件夹。<br>
    <span>提示：</span>如果选择文件分类后，只会显示”当前目录“下该类型的文件，不会显示子文件夹。如果要进入其它文件夹，请先选择”全部“，再点击进入子文件夹。
    </p>    
    <h3>3、其它客户端能删除我的文件吗？</h3>
    <p>
    文件的删除、移动、重命名等操作只在手机服务端开放，客户端只能浏览、下载、播放（用浏览器）音频/视频，和上传文件。
    </p>
    <h3>4、文件的上传、下载会消耗我的流量吗？</h3>
    <p>
    文件的上传、下载都是用内网流量（因为必须要连WiFi才能用），不会用到公网流量，目前没有公网服务器，也不会发送任何东西到公网上去。实际上不用插sim卡，只连wifi就可以当内网服务器用。
    </p>
    <h3>5、上传文件的大小和数量有没限制？</h3>
    <p>
    没限制，只与手机的存储容量、sd卡读写速度，和内网网速有关。有些手机sd卡读写文件可能会比较慢。
    </p>
    <h3>6、是根据后缀名判断文件类型的吗？</h3>
    <p>
    不是根据后缀名判断文件类型，比如把[a.jpg]改名为[a]还是图片文件
    </p>
  </div>
</template>

<style scoped>
.faq{
  margin-top: 1em;
}
p, h3{
  text-align: left;
  margin: 1.0em 1.0em;
}
span {
  color: red;
}
.to-apply{
  margin: 1.9em 1em;
  font-size: 1.7rem;
}
</style>